_posts/2020-01-26-modern-16bit.html
---
layout: post
title: Kapow - 16 bit Assembly in a Modern Assembler (Part 2)
categories: [kapow]
---
<p>
Nowadays, most x86 Assembly programs are intended to run in 64 bit or at least 32 bit environments. This means that most features specific to 16 bit development are now no longer supported. Thus, some workarounds related to this were needed in the development of <i>Kapow</i>.<br />
</p>

<div id="outline-container-orge139362" class="outline-2">
<h2 id="orge139362">What is Real Mode?</h2>
<div class="outline-text-2" id="text-orge139362">
<p>
Whenever your x86 cpu boots up, it always starts up in <a href="https://wiki.osdev.org/Real_Mode">Real Mode</a>. In this mode, your cpu has access to only 16 bit instructions and registers, as well as one megabyte of RAM. In other words, the CPU behaves like an <a href="https://en.wikipedia.org/wiki/Intel_8086">1978 Intel 8086</a> with a much higher clock speed.<br />
</p>
</div>
</div>

<div id="outline-container-org025cdf3" class="outline-2">
<h2 id="org025cdf3">Memory Segmentation</h2>
<div class="outline-text-2" id="text-org025cdf3">
<p>
You might notice that in Real Mode we have access to a whole megabyte of RAM, but yet we are using 16 bit registers to address it. How is it possible to address one million bytes, if in 16 bits we can only represent 64 thousand distinct values? The answer to this question lies in Intel's solution to this problem, <a href="https://wiki.osdev.org/Segmentationhttps://wiki.osdev.org/Segmentation">Memory Segmentation</a>. This is where another register is used to represent an additional 4 bits for addressing. This gives us a total of 20 bits, enough to address one megabyte. In this model, every 64 kilobytes of RAM is referred to as one segment.<br />
</p>
</div>
</div>

<div id="outline-container-orga082870" class="outline-2">
<h2 id="orga082870">Addressing Labels</h2>
<div class="outline-text-2" id="text-orga082870">
<p>
The main problem with using NASM in 16 bit code starts when you are trying to modify the value at a certain label. For example, consider the following code:<br />
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #00fa9a; font-size: 110%; font-weight: bold;">var</span>: <span style="color: #b0c4de;">dw</span> <span style="color: #8470ff; font-weight: bold;">0x123</span>
<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">ax</span>, [var]
<span style="color: #b0c4de;">mul</span> <span style="color: #8470ff; font-weight: bold;">20</span>
<span style="color: #b0c4de;">mov</span> [var], <span style="color: #7fffd4;">ax</span>
</pre>
</div>

<p>
Normally, you would expect this to work. You could use the location at <code>var</code> effectively as a variable, addressing and using its contents. However, when dealing with 16 bit code NASM refuses to do this. <a href="https://www.nasm.us/doc/nasmdoc3.html">Upon further digging</a>, it seemed possible to use <code>seg</code> in order to load the segment of the label, and from this be able to address. But this is impossible to do without using Microsoft <code>COM</code> files. Thus, in order to preserve the debugging advantages of using a modern ELF format, I had to find another solution.<br />
</p>
</div>
</div>

<div id="outline-container-orgaa019a4" class="outline-2">
<h2 id="orgaa019a4">Bootlegged Effective Addressing</h2>
<div class="outline-text-2" id="text-orgaa019a4">
<p>
In order to solve this problem, it was necessary to define an area in memory where variables would be stored. This was done in the <code>game/var_locs.asm</code> file. Here, a base offset is defined, in this case <code>0xC000</code> (Which is an offset from the beginning of the segment where the game's executable resides), and subsequently the location of every single variable used by the game is defined. This also necessitates the initialization of each defined memory location, which is done in the respective file where the variables are used.<br />
</p>
</div>
</div>

<div id="outline-container-orgba201c7" class="outline-2">
<h2 id="orgba201c7">Loading Sprites</h2>
<div class="outline-text-2" id="text-orgba201c7">
<p>
The easiest solution to loading and using sprites would be something like this:<br />
</p>
<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #00fa9a; font-size: 110%; font-weight: bold;">sprite</span>: <span style="color: #b0c4de;">incbin</span> <span style="color: #ffc1c1;">"./mysprite.bin"</span>
<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">ax</span>, <span style="color: #63b8ff;">seg</span> sprite <span style="color: #ff7f24; font-style: italic;">; Moves the segment the sprite is in to ax</span>
<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">es</span>, <span style="color: #7fffd4;">ax</span>
<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">ax</span>, sprite
<span style="color: #b0c4de;">call</span> my_draw_routine
</pre>
</div>
<p>
However, due to the aforementioned problems, this is simply not possible. Instead, a similar approach must be taken to the one used with variables, and the locations used are stored within the file <code>game/sprite_constants.asm</code>. This time, the sprites are stored and loaded in a different segment.<br />
</p>

<p>
In order to do this, the first thing that is done is to fill up the rest of the code segment with 0's. This is done with the following line in <code>/game/game.asm</code>:<br />
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #b0c4de;">times</span> <span style="color: #8470ff; font-weight: bold;">0xFFFF</span> - ($-$$) <span style="color: #b0c4de;">db</span> <span style="color: #8470ff; font-weight: bold;">0</span>
</pre>
</div>

<p>
Doing this greatly aids in the loading process, as we know where the sprites are going to be, exactly 64 kilobytes from the start of the code segment, or in other words in the following segment.<br />
</p>

<p>
The <code>Makefile</code> then takes care of writing the assets to the binary executable, as can be seen from this snippet:<br />
</p>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #00fa9a; font-size: 110%; font-weight: bold;">assets</span>:
        mkdir -p out/assets
        gcc -o out/extract_palette.o src/assets/extract_palette.c
        $(<span style="color: #7fffd4;">CONV</span>) -compress none assets/PALETTE.PCX out/assets/PALETTE.bmp
        out/extract_palette.o out/assets/PALETTE.bmp out/assets/palette.bin
        cat out/assets/palette.bin &gt;&gt; out/HD.img


        gcc -o out/conv_asset.o src/assets/conv_asset.c
        $(<span style="color: #7fffd4;">call</span> add_asset,BOMB,16,32)
        $(<span style="color: #7fffd4;">call</span> add_asset,BOMB8S,8,8)
        $(<span style="color: #7fffd4;">call</span> add_asset,BOMBER,32,32)
        $(<span style="color: #7fffd4;">call</span> add_asset,PADDLE,32,8)
        $(<span style="color: #7fffd4;">call</span> add_asset,CHAR0,12,12)
        $(<span style="color: #7fffd4;">call</span> add_asset,CHAR1,12,12)
        $(<span style="color: #7fffd4;">call</span> add_asset,CHAR2,12,12)
        $(<span style="color: #7fffd4;">call</span> add_asset,CHAR3,12,12)
        $(<span style="color: #7fffd4;">call</span> add_asset,CHAR4,12,12)
        $(<span style="color: #7fffd4;">call</span> add_asset,CHAR5,12,12)
        $(<span style="color: #7fffd4;">call</span> add_asset,CHAR6,12,12)
        $(<span style="color: #7fffd4;">call</span> add_asset,CHAR7,12,12)
        $(<span style="color: #7fffd4;">call</span> add_asset,CHAR8,12,12)
        $(<span style="color: #7fffd4;">call</span> add_asset,CHAR9,12,12)
        $(<span style="color: #7fffd4;">call</span> add_asset,TOPSC,40,12)
        $(<span style="color: #7fffd4;">call</span> add_asset,EXP1,8,8)
        $(<span style="color: #7fffd4;">call</span> add_asset,EXP2,8,8)
        $(<span style="color: #7fffd4;">call</span> add_asset,EXP3,8,8)
        $(<span style="color: #7fffd4;">call</span> add_asset,EXP4,8,8)
        $(<span style="color: #7fffd4;">call</span> add_asset,CHALKBOA,100,32)
        $(<span style="color: #7fffd4;">call</span> add_asset,ENTER,96,20)
</pre>
</div>

<p>
Finally, upon booting, <code>bootup/booter.asm</code> takes care of loading all of the sprite data at the correct segment, where <code>asset_storage</code> is the segment where sprites are to be loaded to. This can be seen here:<br />
</p>
<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">ax</span>, asset_storage
<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">es</span>, <span style="color: #7fffd4;">ax</span>
<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">ah</span>, <span style="color: #8470ff; font-weight: bold;">0x2</span>
<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">al</span>, <span style="color: #8470ff; font-weight: bold;">128</span>
<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">ch</span>, <span style="color: #8470ff; font-weight: bold;">0</span>
<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">dh</span>, <span style="color: #8470ff; font-weight: bold;">2</span>
<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">cl</span>, <span style="color: #8470ff; font-weight: bold;">4</span>
<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">dl</span>, <span style="color: #8470ff; font-weight: bold;">0x80</span>

<span style="color: #b0c4de;">mov</span> <span style="color: #7fffd4;">bx</span>, <span style="color: #8470ff; font-weight: bold;">0</span>               <span style="color: #ff7f24; font-style: italic;">; address to copy to</span>
<span style="color: #b0c4de;">int</span> <span style="color: #8470ff; font-weight: bold;">0x13</span>
</pre>
</div>
</div>
</div>
